[
  {
    "week": "1",
    "title": "What do you hope to achieve this year, both personally and professionally?",
    "examples": [
      "Do you usually set New Year's goals?",
      "How do you stay motivated throughout the year?",
      "What’s one thing you want to improve about yourself this year?",
      "What are some challenges you anticipate this year?",
      "What habits are you trying to build or break?",
      "Do you use any apps or methods to track your progress?",
      "How do you reward yourself when you reach a goal?",
      "Do you prefer setting big goals or small, manageable ones?",
      "Have you ever failed at a goal? What did you learn?",
      "Who inspires you to keep trying?"
    ],
    "phrases": [
      "This year, I'm focusing on...",
      "One of my top goals is to...",
      "I want to improve my ability to..."
    ],
    "tips": [
      "Compare personal vs. professional goals",
      "Share success stories or lessons from past years",
      "Discuss how goal-setting habits differ across cultures"
    ]
  },
  {
    "week": "2",
    "title": "What aspects of your daily routine would you like to change or improve?",
    "examples": [
      "Are you a morning person or a night owl?",
      "How do you typically start and end your day?",
      "Do you think your current routine is healthy?",
      "What part of your routine do you enjoy most?",
      "What’s the most stressful part of your day?",
      "Do you include time for yourself in your schedule?",
      "How has your routine changed over the years?",
      "Are there any habits you want to stop?",
      "What new habit would you like to add to your routine?",
      "Does your routine change on weekends?"
    ],
    "phrases": [
      "I usually start my day with...",
      "One thing I’d like to change is...",
      "My ideal routine would include..."
    ],
    "tips": [
      "Compare weekday vs weekend routines",
      "Talk about productivity tools or time management methods",
      "Discuss cultural differences in daily habits"
    ]
  },
  {
    "week": "3",
    "title": "How does your diet reflect your lifestyle and culture?",
    "examples": [
      "What kind of food do you usually eat during the week?",
      "Do you cook most of your meals or eat out?",
      "Do you follow any dietary restrictions or guidelines?",
      "Is there a food that represents your culture?",
      "Have your eating habits changed recently?",
      "Do you think your diet is healthy?",
      "How do you feel about snacking?",
      "What food do you associate with comfort?",
      "Is food a social activity for you?",
      "Do you enjoy trying cuisines from other countries?"
    ],
    "phrases": [
      "I usually eat... for lunch/dinner.",
      "One traditional dish from my culture is...",
      "I've been trying to eat more/less..."
    ],
    "tips": [
      "Compare eating habits on weekdays vs weekends",
      "Discuss food as part of social life or family culture",
      "Explore how globalization has affected your diet"
    ]
  },
  {
    "week": "4",
    "title": "What role do hobbies play in your mental well-being?",
    "examples": [
      "What hobbies do you have now?",
      "How do they help you relax or recharge?",
      "Have your hobbies changed over time?",
      "Do you prefer hobbies that are active or passive?",
      "Have you ever turned a hobby into a job?",
      "Do you enjoy doing hobbies alone or with others?",
      "What hobby would you like to try if you had more time?",
      "Do you spend money on your hobbies?",
      "Have you ever given up a hobby? Why?",
      "How do your hobbies reflect your personality?"
    ],
    "phrases": [
      "In my free time, I enjoy...",
      "One hobby that helps me relax is...",
      "I've been doing this hobby since..."
    ],
    "tips": [
      "Compare indoor vs outdoor hobbies",
      "Discuss whether hobbies can turn into careers",
      "Talk about hobbies you've picked up recently or during a specific period like lockdown"
    ]
  },
  {
    "week": "5",
    "title": "How has travel changed your perspective on life?",
    "examples": [
      "What’s the most memorable place you’ve ever visited?",
      "How do you usually plan your trips?",
      "Do you prefer solo travel or group travel?",
      "Have you experienced culture shock?",
      "What have you learned from people you met abroad?",
      "Do you prefer cities, nature, or historical sites?",
      "Has a trip ever changed your mindset?",
      "How do you prepare for international travel?",
      "Would you like to live abroad someday?",
      "How do you document or remember your trips?"
    ],
    "phrases": [
      "One of my favorite trips was to...",
      "Traveling taught me that...",
      "I was really surprised by..."
    ],
    "tips": [
      "Compare domestic vs. international travel experiences",
      "Discuss cultural surprises or misunderstandings",
      "Share travel dreams or bucket list destinations"
    ]
  },
  {
    "week": "6",
    "title": "What makes a relationship meaningful to you?",
    "examples": [
      "What qualities do you value in a friend or partner?",
      "Have you ever had a friendship that changed your life?",
      "Do you believe in soulmates or destiny in relationships?",
      "What’s the difference between a friend and an acquaintance?",
      "How do you usually keep in touch with close friends?",
      "Do you find it easy or difficult to make new friends?",
      "How do you rebuild trust after a conflict?",
      "What role does honesty play in relationships?",
      "How do cultural norms affect the way we build relationships?",
      "What advice would you give for maintaining a strong relationship?"
    ],
    "phrases": [
      "A good relationship is based on...",
      "Someone I really trust is...",
      "One thing I value in relationships is..."
    ],
    "tips": [
      "Explore different types of relationships (friendship, romantic, professional)",
      "Share a meaningful story involving someone important in your life",
      "Compare how relationships are formed or maintained across cultures"
    ]
  },  
  {
    "week": "7",
    "title": "How do you manage stress in your daily life?",
    "examples": [
      "What usually causes you stress?",
      "How does your body react when you’re stressed?",
      "Do you have a favorite way to relax or unwind?",
      "How do you balance work and personal time?",
      "Have you ever taken a break or mental health day?",
      "Do you believe stress can be helpful in any way?",
      "How do you support someone who is feeling overwhelmed?",
      "What role does sleep or exercise play in stress relief?",
      "Have your stress management strategies changed over time?",
      "Do you think your culture handles stress differently?"
    ],
    "phrases": [
      "When I'm stressed, I usually...",
      "One thing that really helps me is...",
      "I try to stay calm by..."
    ],
    "tips": [
      "Compare short-term vs long-term stress relief methods",
      "Discuss cultural attitudes toward stress and self-care",
      "Share apps, habits, or routines that help manage stress"
    ]
  },
  {
    "week": "8",
    "title": "How does the winter season affect your lifestyle or mood?",
    "examples": [
      "Do you like winter? Why or why not?",
      "How do you usually spend your time during cold months?",
      "Do you have any winter traditions or favorite activities?",
      "What foods or drinks do you enjoy in winter?",
      "Do you find it harder to stay motivated in winter?",
      "How does your mood change with the seasons?",
      "Have you ever experienced the winter blues?",
      "What’s your favorite winter memory?",
      "How do people in your culture typically spend winter?",
      "Would you rather live in a warm or cold climate?"
    ],
    "phrases": [
      "In winter, I tend to...",
      "One thing I love about winter is...",
      "Cold weather makes me feel..."
    ],
    "tips": [
      "Talk about seasonal routines and changes in behavior",
      "Compare winter experiences in different countries or regions",
      "Share cozy traditions, holidays, or ways to stay active indoors"
    ]
  },
  {
    "week": "9",
    "title": "How do you try to balance work and personal life?",
    "examples": [
      "Do you feel satisfied with your current work-life balance?",
      "What helps you switch off after work?",
      "How do you make time for hobbies or rest?",
      "Have you ever experienced burnout? How did you handle it?",
      "Do you set boundaries between work and home life?",
      "How does your country or culture view overwork?",
      "What would your ideal work schedule look like?",
      "Do you take regular vacations or breaks?",
      "How do you manage time effectively?",
      "What advice would you give to someone struggling with balance?"
    ],
    "phrases": [
      "I try to separate work and home by...",
      "It’s important for me to...",
      "One thing that helps me is..."
    ],
    "tips": [
      "Compare how different countries handle work-life balance",
      "Discuss the importance of downtime and rest",
      "Share routines or small changes that helped you feel better"
    ]
  },
  {
    "week": "10",
    "title": "What motivates you to start something new?",
    "examples": [
      "Do you enjoy trying new things or prefer routine?",
      "What’s something new you've started recently?",
      "What makes you hesitate to start something new?",
      "How do you stay motivated in the beginning?",
      "Have you ever started a new habit that changed your life?",
      "What are some tips for getting started with a new project?",
      "Do you usually finish what you start?",
      "What helps you overcome fear of failure?",
      "Is it better to plan carefully or just jump in?",
      "What’s something you’d like to try this year?"
    ],
    "phrases": [
      "I've always wanted to try...",
      "I finally decided to start...",
      "What got me going was..."
    ],
    "tips": [
      "Share stories of both success and failure",
      "Explore internal vs external motivation",
      "Talk about how people around you influence your decisions"
    ]
  },
  {
    "week": "11",
    "title": "How do you refresh or reorganize your life in spring?",
    "examples": [
      "Do you do any spring cleaning or organizing?",
      "How do you usually prepare for the new season?",
      "Do you have any routines for refreshing your space or habits?",
      "What part of your life would you like to simplify?",
      "Do you ever reflect on your habits at the change of seasons?",
      "What motivates you to make changes in your life?",
      "How do you stay focused when decluttering or organizing?",
      "Have you ever let go of something and felt better?",
      "What role does your physical environment play in your mood?",
      "Do you set seasonal goals or intentions?"
    ],
    "phrases": [
      "Spring is the perfect time to...",
      "I feel refreshed when I...",
      "One habit I’m trying to change this spring is..."
    ],
    "tips": [
      "Talk about physical vs mental clutter",
      "Share routines for refreshing your space or schedule",
      "Compare cultural spring traditions and cleaning habits"
    ]
  },
  {
    "week": "12",
    "title": "How do you deal with goodbyes and new beginnings?",
    "examples": [
      "Have you ever had a difficult goodbye?",
      "Do you usually keep in touch with people after moving on?",
      "What helps you cope with big changes?",
      "Do you enjoy starting over in a new environment?",
      "What’s something you learned from a major transition in life?",
      "How do you say goodbye—formally, emotionally, casually?",
      "Have you ever regretted not saying goodbye properly?",
      "Do you like or dislike change? Why?",
      "What are the pros and cons of a fresh start?",
      "Do you have any rituals or habits for marking new chapters?"
    ],
    "phrases": [
      "It was hard to say goodbye to...",
      "I always try to stay connected by...",
      "A fresh start can be both exciting and scary because..."
    ],
    "tips": [
      "Share experiences of starting a new job, school, or moving",
      "Discuss emotional vs practical challenges of change",
      "Explore cultural differences in farewell customs"
    ]
  },
  {
    "week": "13",
    "title": "What are some memories you will never forget?",
    "examples": [
      "What’s one childhood memory that stands out?",
      "Have you ever had a life-changing experience?",
      "What’s the most embarrassing thing you remember?",
      "Is there a place that holds special memories for you?",
      "Who is someone that made a big impact on your life?",
      "Do smells, sounds, or songs trigger certain memories for you?",
      "What’s a memory that makes you smile every time?",
      "Have your memories of an event changed over time?",
      "Do you keep journals or photo albums to remember things?",
      "Why do you think we forget some things but remember others so clearly?"
    ],
    "phrases": [
      "One memory that always stays with me is...",
      "I’ll never forget the time when...",
      "Every time I think about it, I feel..."
    ],
    "tips": [
      "Share both funny and meaningful stories",
      "Talk about how memory connects to emotion",
      "Explore how memories influence our choices today"
    ]
  },
  {
    "week": "14",
    "title": "How do you approach meeting new people and making a good impression?",
    "examples": [
      "Do you enjoy meeting new people, or do you find it stressful?",
      "What do you think makes a good first impression?",
      "Have you ever made a bad first impression? What happened?",
      "How do you usually introduce yourself in a new environment?",
      "Do you remember how you met your closest friend?",
      "How do you start conversations with strangers?",
      "Is small talk important in your culture?",
      "Do you prefer group introductions or one-on-one conversations?",
      "What’s your strategy when entering a new social group?",
      "How have your social skills changed over time?"
    ],
    "phrases": [
      "When I meet someone new, I usually...",
      "A smile and eye contact go a long way.",
      "I try to ask questions to get to know the other person."
    ],
    "tips": [
      "Compare cultural norms for greetings and small talk",
      "Discuss body language and non-verbal impressions",
      "Share funny or awkward first-meeting stories"
    ]
  },
  {
    "week": "15",
    "title": "What’s something new you've tried recently, and how did it go?",
    "examples": [
      "Have you tried anything outside your comfort zone lately?",
      "What motivates you to try new things?",
      "Do you enjoy challenges, or do you prefer routines?",
      "What's a time you were surprised by your own ability?",
      "How do you deal with fear of failure when trying something new?",
      "What’s something new you’ve learned recently?",
      "Is there something you want to try but haven’t yet?",
      "Do you tend to plan ahead or take action spontaneously?",
      "Have your tastes or interests changed over time?",
      "What advice would you give someone afraid to try something new?"
    ],
    "phrases": [
      "I wasn’t sure at first, but I gave it a try.",
      "It turned out better than I expected!",
      "Trying new things helps me grow."
    ],
    "tips": [
      "Talk about personal growth through new experiences",
      "Discuss how mindset affects willingness to try new things",
      "Compare risk-taking styles in different cultures or personality types"
    ]
  },  
  {
    "week": "16",
    "title": "How do you adjust to change and build new habits?",
    "examples": [
      "How do you usually deal with new situations?",
      "What helps you adapt to a new environment?",
      "Have you built any new routines recently?",
      "What’s a habit you’re proud of maintaining?",
      "How long does it take for something to feel ‘normal’ to you?",
      "Do you enjoy routines or prefer flexibility?",
      "What’s the hardest habit you’ve ever tried to form?",
      "How do you stay motivated during the adjustment period?",
      "Do you track your habits in any way?",
      "Have you ever made a change that improved your life significantly?"
    ],
    "phrases": [
      "At first, it was hard, but I got used to it.",
      "One habit that changed my life is...",
      "I’m still adjusting, but it’s getting better."
    ],
    "tips": [
      "Talk about mental vs physical habits",
      "Compare how people deal with change in different cultures",
      "Share success/failure stories of building habits"
    ]
  },
  {
    "week": "17",
    "title": "How do you like to spend long weekends or holidays?",
    "examples": [
      "What’s your ideal way to spend a day off?",
      "Do you prefer to stay home or travel?",
      "How do you usually plan your holidays?",
      "What’s your favorite holiday memory?",
      "Have you ever taken a ‘staycation’?",
      "Do you feel recharged after holidays, or tired?",
      "What kind of activities help you relax during breaks?",
      "Are there any holiday traditions you follow?",
      "What do you usually eat or do on holidays?",
      "If you had a 3-day weekend, what would you do?"
    ],
    "phrases": [
      "I love taking short trips during holidays.",
      "Sometimes I just want to rest and do nothing.",
      "Long weekends are perfect for trying something new."
    ],
    "tips": [
      "Discuss cultural holidays and personal traditions",
      "Compare relaxing vs active holiday styles",
      "Share tips for planning a meaningful break"
    ]
  },
  {
    "week": "18",
    "title": "What did you do during your recent time off, and how did it affect you?",
    "examples": [
      "Did you travel, stay home, or do something else?",
      "What was the highlight of your holiday?",
      "Did you get enough rest or were you busy?",
      "What would you do differently next time?",
      "How do you feel now that the holiday is over?",
      "Do you usually feel motivated or sluggish after breaks?",
      "Did you spend time with family, friends, or alone?",
      "Did you try anything new over the break?",
      "Did you get to do everything you planned?",
      "How do holidays affect your mental or physical energy?"
    ],
    "phrases": [
      "During the break, I finally had time to...",
      "One memorable moment was when...",
      "Coming back to daily life felt..."
    ],
    "tips": [
      "Talk about the balance between rest and activity",
      "Compare short breaks vs long vacations",
      "Reflect on how holidays help (or don’t help) recharge"
    ]
  },
  {
    "week": "19",
    "title": "How do you stay motivated when you're feeling low?",
    "examples": [
      "What do you do when you feel unmotivated?",
      "Do you have any tricks to boost your mood or energy?",
      "How do you handle procrastination?",
      "Do certain people or environments affect your motivation?",
      "How do you get back on track after losing focus?",
      "What’s something that always gives you a little push?",
      "Do you allow yourself to rest when you're not feeling up to it?",
      "How do you balance self-discipline and self-compassion?",
      "Have your motivation strategies changed over time?",
      "What role does music, exercise, or nature play in your mood?"
    ],
    "phrases": [
      "When I feel low, I try to...",
      "Sometimes, I just need a small win to get going.",
      "What helps me most is..."
    ],
    "tips": [
      "Discuss external vs internal motivation",
      "Share go-to methods for overcoming slumps",
      "Talk about how mood affects productivity and mindset"
    ]
  },  
  {
    "week": "20",
    "title": "What role does nature play in your daily life?",
    "examples": [
      "Do you spend much time outdoors?",
      "What’s your favorite natural place to visit?",
      "How do you feel when you're surrounded by nature?",
      "Do you have plants or a garden at home?",
      "How often do you go for a walk or hike?",
      "Do you notice seasonal changes around you?",
      "What’s the most beautiful natural place you’ve seen?",
      "Do you prefer beaches, forests, or mountains?",
      "Have you ever tried forest bathing or mindfulness in nature?",
      "How does nature affect your stress levels or mood?"
    ],
    "phrases": [
      "Being in nature helps me...",
      "I like spending time outdoors because...",
      "Even a short walk outside makes a big difference."
    ],
    "tips": [
      "Compare urban vs rural lifestyles",
      "Discuss how nature affects creativity or focus",
      "Talk about favorite seasons and outdoor traditions"
    ]
  },
  {
    "week": "21",
    "title": "How do you take care of your mental health?",
    "examples": [
      "What activities help you relax or feel grounded?",
      "Do you ever take mental health days?",
      "How do you manage stress and anxiety?",
      "Do you talk to friends or professionals when you’re feeling low?",
      "How do you stay emotionally balanced during busy times?",
      "What habits support your mental well-being?",
      "How do you notice when you need a break?",
      "Do you practice any mindfulness or meditation?",
      "Has your mental health approach changed over the years?",
      "What advice would you give someone going through a hard time?"
    ],
    "phrases": [
      "I try to protect my mental health by...",
      "When I’m overwhelmed, I usually...",
      "It’s important to me to make space for..."
    ],
    "tips": [
      "Distinguish between physical and emotional self-care",
      "Explore cultural views on mental health",
      "Share simple, everyday actions that help maintain balance"
    ]
  },  
  {
    "week": "22",
    "title": "What does 'home' mean to you?",
    "examples": [
      "What makes a place feel like home?",
      "Do you prefer staying home or going out?",
      "What do you miss most when you're away from home?",
      "Have you ever lived in a place that didn’t feel like home?",
      "How would you describe your ideal home environment?",
      "What routines or items bring you comfort at home?",
      "Is 'home' more about people, place, or feeling for you?",
      "Have you ever had to move often? How did it affect you?",
      "How do you decorate or personalize your living space?",
      "How does your concept of home change over time?"
    ],
    "phrases": [
      "To me, home is where...",
      "I feel most relaxed when I'm at...",
      "One thing I need to feel at home is..."
    ],
    "tips": [
      "Discuss the emotional vs physical aspects of 'home'",
      "Compare urban and rural ideas of comfort",
      "Explore cultural differences in the idea of home"
    ]
  },
  {
    "week": "23",
    "title": "How do you stay productive during rainy or lazy days?",
    "examples": [
      "Do you feel less motivated on gloomy days?",
      "What helps you stay focused when you’d rather relax?",
      "Do you change your routine depending on the weather?",
      "Have you developed any rainy-day habits?",
      "Do you prefer to push through or take it easy?",
      "How do you balance rest and productivity?",
      "What’s your favorite thing to do on a rainy day?",
      "Do you find weather affects your emotions or energy?",
      "Do you use music, lighting, or food to shift your mood?",
      "Have you ever had a surprisingly productive rainy day?"
    ],
    "phrases": [
      "On rainy days, I usually...",
      "To stay productive, I try to...",
      "I give myself small goals like..."
    ],
    "tips": [
      "Talk about the link between environment and motivation",
      "Share rituals or mini routines for low-energy days",
      "Explore the idea of seasonal productivity rhythms"
    ]
  },
  {
    "week": "24",
    "title": "What are your favorite indoor activities?",
    "examples": [
      "How do you usually spend time indoors?",
      "Do you enjoy reading, watching movies, or doing crafts?",
      "Have you learned any new indoor hobbies recently?",
      "What’s your ideal rainy day at home?",
      "Do you cook or bake as a hobby?",
      "How do you stay active indoors?",
      "Do you like being alone or with others during indoor time?",
      "Have you ever tried meditation or journaling?",
      "What’s a creative activity you enjoy?",
      "Do you need alone time to recharge?"
    ],
    "phrases": [
      "When I stay in, I usually...",
      "One indoor activity I love is...",
      "Rainy days are perfect for..."
    ],
    "tips": [
      "Compare active vs relaxing indoor hobbies",
      "Share tips for avoiding boredom at home",
      "Talk about how indoor time can boost creativity"
    ]
  },
  {
    "week": "25",
    "title": "How do you take care of yourself emotionally and physically?",
    "examples": [
      "What are your favorite ways to de-stress?",
      "How do you manage your energy levels?",
      "Do you have a regular sleep schedule or self-care routine?",
      "What role does food, movement, or rest play in your well-being?",
      "How do you stay in tune with your emotions?",
      "Do you take breaks before feeling overwhelmed?",
      "Have you ever felt burnout? What helped?",
      "How do you create balance in your week?",
      "What’s one thing you do just for yourself?",
      "Do you make time to be alone, or with supportive people?"
    ],
    "phrases": [
      "I feel balanced when I...",
      "I try to listen to my body by...",
      "One thing I do to care for myself is..."
    ],
    "tips": [
      "Talk about mental vs physical health habits",
      "Share simple ways to recharge during busy times",
      "Explore the idea of 'preventive self-care' vs 'emergency recovery'"
    ]
  },
  {
    "week": "26",
    "title": "What have you learned in the first half of the year?",
    "examples": [
      "What were your biggest challenges since January?",
      "What’s something you’re proud of so far this year?",
      "Have you made progress toward any goals?",
      "What habits or routines worked well for you?",
      "What surprised you about the past few months?",
      "Did you try anything new or unexpected?",
      "What have you learned about yourself this year?",
      "Have your priorities changed since the beginning of the year?",
      "What advice would you give yourself in January?",
      "What would you like to improve in the second half of the year?"
    ],
    "phrases": [
      "One lesson I’ve learned this year is...",
      "Looking back, I’m glad I...",
      "Something I didn’t expect was..."
    ],
    "tips": [
      "Encourage reflection, not just success stories",
      "Talk about small wins, not just big achievements",
      "Compare expectations vs reality of the year so far"
    ]
  },
  {
    "week": "27",
    "title": "How do you stay cool and energized in summer?",
    "examples": [
      "Do you enjoy summer or find it difficult?",
      "How do you stay physically cool during hot weather?",
      "What foods or drinks help you beat the heat?",
      "Do you change your schedule or habits in summer?",
      "How do you keep your energy levels up?",
      "Do you prefer indoor or outdoor activities in summer?",
      "What’s your favorite thing about this season?",
      "What’s one summer memory that makes you smile?",
      "Do you find it hard to focus when it’s hot?",
      "What’s one tip you’d share for surviving summer?"
    ],
    "phrases": [
      "In summer, I try to...",
      "To stay cool, I usually...",
      "I like to recharge by..."
    ],
    "tips": [
      "Compare coping strategies across different climates",
      "Share energy-boosting or cooling routines",
      "Talk about sensory changes—light, heat, mood"
    ]
  },  
  {
    "week": "28",
    "title": "What are your plans or hopes for this summer?",
    "examples": [
      "Do you have any summer goals or plans?",
      "Is there something new you want to try this summer?",
      "Are you planning to travel or stay local?",
      "What do you want to experience before summer ends?",
      "How do you usually spend your summers?",
      "Do you prefer active or relaxing summers?",
      "What’s one thing you always associate with summer?",
      "How do your habits change during this season?",
      "What would a perfect summer day look like for you?",
      "Do you usually reach your summer goals?"
    ],
    "phrases": [
      "This summer, I’m planning to...",
      "One thing I want to do is...",
      "I hope to make time for..."
    ],
    "tips": [
      "Differentiate between dreams and realistic plans",
      "Talk about balancing fun and productivity",
      "Explore the emotional tone of summer (freedom, restlessness, excitement)"
    ]
  },
  {
    "week": "29",
    "title": "What do you enjoy learning, and how do you stay curious?",
    "examples": [
      "What’s something you’re interested in right now?",
      "Do you enjoy learning new skills or topics?",
      "Have you ever taken a class or course as an adult?",
      "How do you usually learn—books, videos, hands-on?",
      "What’s a subject you never liked in school but like now?",
      "Do you think curiosity changes as we get older?",
      "What motivates you to keep learning?",
      "Do you prefer structured learning or exploring freely?",
      "Have you ever learned something that changed your view of the world?",
      "Is there a topic or skill you’d like to explore this summer?"
    ],
    "phrases": [
      "Lately, I’ve been really interested in...",
      "I love learning when I can...",
      "One thing I want to study more is..."
    ],
    "tips": [
      "Compare formal vs informal learning styles",
      "Talk about personal growth through curiosity",
      "Share stories of unexpected learning experiences"
    ]
  },  
  {
    "week": "30",
    "title": "What do you like to do when you have a lot of free time?",
    "examples": [
      "How do you usually spend a completely free day?",
      "Do you enjoy planning your free time or being spontaneous?",
      "What’s your favorite way to relax when there are no obligations?",
      "Have you ever had a long break that changed your perspective?",
      "Do you get bored easily during long holidays?",
      "What’s something meaningful you've done during a break?",
      "Do you feel guilty when you're not being productive?",
      "How do you balance rest and activity in free time?",
      "What’s your dream way to spend a week off?",
      "Do you prefer quiet solo time or fun with others?"
    ],
    "phrases": [
      "When I have a lot of time, I love to...",
      "It’s rare, but when I get time off, I usually...",
      "Unstructured time helps me to..."
    ],
    "tips": [
      "Compare quiet vs active ways to enjoy time off",
      "Talk about digital detox or escaping routines",
      "Explore how free time reveals our values"
    ]
  },
  {
    "week": "31",
    "title": "What kind of memories do you want to create this summer?",
    "examples": [
      "What makes a summer unforgettable for you?",
      "Do you have a summer bucket list?",
      "What kind of moments do you want to look back on?",
      "Who do you hope to spend time with this summer?",
      "Is there a tradition you want to keep or start?",
      "Do you take photos, write journals, or just live in the moment?",
      "What smells, sounds, or tastes mean 'summer' to you?",
      "Do you enjoy repeating the same summer activities every year?",
      "What’s something spontaneous you hope will happen?",
      "How would you like to feel at the end of this summer?"
    ],
    "phrases": [
      "This summer, I hope to make memories by...",
      "I want to look back and remember...",
      "Summer is the best time to..."
    ],
    "tips": [
      "Talk about the emotional side of memory-making",
      "Compare routine summers vs unique summers",
      "Encourage thinking about legacy and personal joy"
    ]
  },
  {
    "week": "32",
    "title": "How do you stay focused and energized during the hottest days of summer?",
    "examples": [
      "Do you find it hard to concentrate when it’s really hot?",
      "What helps you stay productive in summer?",
      "Do you take naps or adjust your schedule?",
      "What foods or drinks help you feel refreshed?",
      "Do you use fans, AC, or other tricks to stay cool?",
      "Do you exercise in summer, or switch to gentler routines?",
      "Have you ever felt completely drained by the heat?",
      "Do you take more breaks or change your workflow in summer?",
      "How do you keep your mood up during the hottest weeks?",
      "Do you listen to music or use scents to boost your energy?"
    ],
    "phrases": [
      "In hot weather, I try to...",
      "One way I stay focused is...",
      "To keep my energy up, I usually..."
    ],
    "tips": [
      "Discuss energy management strategies",
      "Compare heat-related habits across cultures",
      "Encourage sharing little-known self-care hacks"
    ]
  },
  {
    "week": "33",
    "title": "How do you spend Obon, or holidays that honor the past?",
    "examples": [
      "Do you visit your family grave during Obon?",
      "What traditions does your family follow in Obon?",
      "Do you welcome spirits with lanterns or offerings?",
      "What foods or customs are part of your Obon?",
      "Do you travel back to your hometown?",
      "How do you feel during Obon—spiritual, nostalgic, relaxed?",
      "Have your Obon traditions changed over the years?",
      "Do you explain Obon to people from other cultures?",
      "Is there a person you remember especially at this time of year?",
      "What’s the atmosphere like in your town during Obon?"
    ],
    "phrases": [
      "During Obon, we usually...",
      "My family’s Obon tradition is...",
      "Obon reminds me of..."
    ],
    "tips": [
      "Encourage sharing of different family customs",
      "Create space for quiet reflection and personal stories",
      "Compare Obon with holidays like Día de los Muertos or All Souls’ Day"
    ]
  },
  {
    "week": "34",
    "title": "Did you enjoy any classic summer activities this year?",
    "examples": [
      "Did you go to the beach or a pool?",
      "Have you been to any festivals or fireworks displays?",
      "Did you eat any typical summer foods like shaved ice or watermelon?",
      "Have you done a barbecue or picnic recently?",
      "Did you wear yukata or summer clothes for an event?",
      "Have you tried a new summer activity this year?",
      "Did you do anything that made you think, 'This is summer!'?",
      "Do you have a favorite summer tradition?",
      "Was there anything you planned but didn’t do?",
      "Do you enjoy being outdoors in summer, or do you avoid the heat?"
    ],
    "phrases": [
      "This year, I went to...",
      "My summer wouldn’t be complete without...",
      "One thing I wish I had done is..."
    ],
    "tips": [
      "Encourage specific stories and scenes",
      "Include nostalgic or sensory memories (smells, sounds, tastes)",
      "Contrast city vs countryside summer experiences"
    ]
  },
  {
    "week": "35",
    "title": "What’s your favorite part of summer, and did you get to enjoy it?",
    "examples": [
      "What’s your number one summer activity?",
      "Did you get to enjoy it this year?",
      "Do you like the food, the atmosphere, or the freedom of summer?",
      "Do you usually have a summer tradition or routine?",
      "What’s something you look forward to every summer?",
      "What summer activity do you try to avoid?",
      "Is there something you always try to do before summer ends?",
      "Do you think summer feels shorter as an adult?",
      "What would your perfect summer include?",
      "Do you feel satisfied with your summer this year?"
    ],
    "phrases": [
      "The best part of summer for me is...",
      "I really enjoyed...",
      "Next year, I definitely want to..."
    ],
    "tips": [
      "Make it visual and sensory—foods, sounds, places",
      "Invite comparisons: this year vs past years",
      "Use it as a lead-in to transition into autumn topics next week"
    ]
  },
  {
    "week": "36",
    "title": "What signs of autumn do you notice around you?",
    "examples": [
      "Has the weather started to feel like autumn where you live?",
      "Do you notice changes in the air, light, or sky?",
      "Are there any sounds or smells that remind you of fall?",
      "Do you see any seasonal decorations or products in stores?",
      "Have school schedules or daily routines changed around you?",
      "Do you feel any change in your mood or energy?",
      "Is there a place where autumn arrives early near you?",
      "What kind of clothes or items do you start to use in early fall?",
      "Have you started thinking about autumn plans or events?",
      "Do you enjoy this seasonal shift?"
    ],
    "phrases": [
      "Lately, I’ve started to notice...",
      "One sign of autumn I always look for is...",
      "The air feels different when..."
    ],
    "tips": [
      "Focus on sensory experiences: air, light, smell, temperature",
      "Encourage comparisons: summer vs early autumn",
      "Make space for small, personal observations"
    ]
  },
  {
    "week": "37",
    "title": "What’s your favorite thing to eat or do in early autumn?",
    "examples": [
      "Do you look forward to any seasonal foods?",
      "Have you had any early autumn dishes yet?",
      "What kind of activities feel perfect in early fall?",
      "Do you enjoy cooking or baking in cooler weather?",
      "Is there a fruit, vegetable, or drink you associate with autumn?",
      "Do you like to go on walks or outings in early fall?",
      "Are there any events or markets you like this time of year?",
      "Do your cravings change with the seasons?",
      "What’s your go-to comfort food when the air gets cool?",
      "Have you noticed any limited-edition seasonal products lately?"
    ],
    "phrases": [
      "In early autumn, I love to eat...",
      "I always look forward to...",
      "When the weather cools down, I like to..."
    ],
    "tips": [
      "Encourage mouth-watering descriptions and personal favorites",
      "Bring in food culture or local specialties",
      "Set a relaxed, cozy tone—early autumn is for slowing down"
    ]
  },
  {
    "week": "38",
    "title": "Have you taken any short trips or autumn outings recently?",
    "examples": [
      "Did you travel anywhere during the long weekend or holidays?",
      "Do you enjoy taking day trips in autumn?",
      "Have you visited any scenic places this month?",
      "What’s your favorite nearby place to visit in this season?",
      "Do you prefer mountains, countryside, or city strolls in autumn?",
      "Did you go hiking, fruit picking, or to a local event?",
      "How do you decide where to go for a short trip?",
      "Do you like to plan trips or go spontaneously?",
      "What’s something you saw or experienced that felt very 'autumn'?",
      "Is there a seasonal outing you look forward to every year?"
    ],
    "phrases": [
      "Last weekend, I went to...",
      "One place I recommend in autumn is...",
      "The view was beautiful because..."
    ],
    "tips": [
      "Invite specific sensory details—colors, sounds, temperature",
      "Compare solo vs group outings",
      "Encourage recommendations of hidden local spots"
    ]
  },
  {
    "week": "39",
    "title": "What do you enjoy most about autumn?",
    "examples": [
      "Is there a smell, sound, or scene that makes you love autumn?",
      "Do you enjoy the weather in this season?",
      "What foods do you especially like in autumn?",
      "Are there any traditions or festivals you look forward to?",
      "Do you notice changes in your daily routine in autumn?",
      "Is there a part of autumn that makes you feel nostalgic?",
      "Do you feel more creative, relaxed, or reflective in this season?",
      "How do you decorate or change your space for autumn?",
      "Are there books, music, or movies you enjoy more in fall?",
      "Do you think autumn has a unique mood compared to other seasons?"
    ],
    "phrases": [
      "The best thing about autumn for me is...",
      "I always look forward to...",
      "Autumn makes me feel..."
    ],
    "tips": [
      "Focus on emotional + sensory appeal",
      "Encourage storytelling and seasonal routines",
      "Make room for both fun and reflective tones"
    ]
  },

  {
    "week": "40",
    "title": "Have you enjoyed any seasonal events or festivals recently?",
    "examples": [
      "Have you been to any autumn festivals or outdoor events?",
      "Do you enjoy cultural festivals, food fairs, or local markets?",
      "Are there any seasonal events in your neighborhood?",
      "What kind of events do you usually go to in autumn?",
      "Have you been to a harvest festival or sports day recently?",
      "Do you prefer large crowds or small community events?",
      "What’s the last outdoor event you attended?",
      "Do you usually go with friends, family, or alone?",
      "Is there an event you look forward to every year?",
      "Have you ever volunteered or performed at a festival?"
    ],
    "phrases": [
      "Last weekend, I went to...",
      "One of my favorite events in autumn is...",
      "The atmosphere was so lively and colorful!"
    ],
    "tips": [
      "Encourage discussion of local culture and traditions",
      "Invite vivid descriptions of sounds, foods, and scenes",
      "Compare city vs rural festival experiences"
    ]
  },
  {
    "week": "41",
    "title": "Do you celebrate Halloween or enjoy the seasonal atmosphere?",
    "examples": [
      "Do you usually dress up for Halloween?",
      "Have you ever carved a pumpkin?",
      "Do you decorate your house or classroom?",
      "Is Halloween popular in your community?",
      "Do you enjoy spooky movies or haunted attractions?",
      "Have you ever gone trick-or-treating (or taken someone)?",
      "Do you prefer cute or scary Halloween themes?",
      "What do you think about Halloween as a cultural event?",
      "Do you enjoy Halloween food or snacks?",
      "Have you ever made or worn a costume you’re proud of?"
    ],
    "phrases": [
      "This year, I might dress up as...",
      "I don’t celebrate, but I like the atmosphere.",
      "Halloween always reminds me of..."
    ],
    "tips": [
      "Compare Halloween traditions across countries",
      "Make room for both participants and observers",
      "Focus on the visual and fun side, not just cultural depth"
    ]
  },
  {
    "week": "42",
    "title": "Have you gone to see the autumn leaves this year?",
    "examples": [
      "Have you visited any spots famous for autumn colors?",
      "Do you have a favorite place to see the leaves?",
      "What’s the best time to go leaf-viewing in your area?",
      "Do you prefer mountains, parks, or temples for viewing?",
      "Did you take any pictures of the trees?",
      "Do you go leaf-peeping alone, with friends, or family?",
      "What color leaves do you like the most?",
      "Do you usually bring snacks or a lunch on these outings?",
      "What kind of atmosphere do you enjoy while viewing nature?",
      "Have you ever traveled far just to see the autumn scenery?"
    ],
    "phrases": [
      "This year, I went to see the leaves at...",
      "I love the way the colors change in...",
      "The view was absolutely beautiful!"
    ],
    "tips": [
      "Encourage descriptions of color, light, and sound",
      "Invite comparisons between different years or places",
      "Share small personal traditions (tea, walks, photos)"
    ]
  },
  {
    "week": "43",
    "title": "What helps you enjoy cozy, slow-paced autumn days?",
    "examples": [
      "Do you enjoy staying home more in autumn?",
      "What’s your favorite drink or snack for relaxing in fall?",
      "Do you read, watch movies, or listen to music more in this season?",
      "How do you make your space feel cozy?",
      "Do you have any evening or weekend autumn routines?",
      "Do you enjoy candles, blankets, or warm lighting?",
      "What kinds of clothes do you love to wear in fall?",
      "Do you journal, reflect, or take things slower in this season?",
      "Is there a time of day that feels especially relaxing in autumn?",
      "What’s one thing that always makes you feel at ease?"
    ],
    "phrases": [
      "In autumn, I love to slow down by...",
      "My perfect cozy day includes...",
      "I feel most relaxed when..."
    ],
    "tips": [
      "Focus on mood, texture, and sensory warmth",
      "Encourage sharing of small daily pleasures",
      "Bring in lifestyle details—scented tea, music, lighting"
    ]
  },
      {
    "week": "44",
    "title": "Do you enjoy seasonal foods in autumn?",
    "examples": [
      "What’s your favorite autumn food?",
      "Have you eaten any sweet potatoes or chestnuts recently?",
      "Do you like cooking with mushrooms or pumpkin in fall?",
      "Do you enjoy limited-edition seasonal items (like from Starbucks or convenience stores)?",
      "Have you been to a restaurant that had a seasonal menu?",
      "Do you change what you eat when the weather gets cooler?",
      "Do you like fruit like persimmons or grapes in autumn?",
      "Have you tried any traditional Japanese autumn dishes?",
      "Do you prefer savory or sweet autumn foods?",
      "Do you have any family dishes you eat only in autumn?"
    ],
    "phrases": [
      "In autumn, I always eat...",
      "I tried a new dish with...",
      "I love the taste of..."
    ],
    "tips": [
      "Encourage sharing recipes, food photos, or memories",
      "Great chance to talk about regional foods",
      "Include both home-cooked and store-bought items"
    ]
  },
  {
    "week": "45",
    "title": "Have you read any good books or watched any good movies lately?",
    "examples": [
      "What book are you reading right now?",
      "Have you seen any interesting movies or shows recently?",
      "Do you prefer reading fiction or non-fiction?",
      "Do you have a favorite genre?",
      "Is there a book or movie you would recommend to others?",
      "Do you usually read or watch things in English or Japanese?",
      "Do you use subtitles when watching movies in English?",
      "Has a book or movie ever changed the way you think?",
      "Do you prefer going to the cinema or watching at home?",
      "Is there a story you’d love to see made into a movie?"
    ],
    "phrases": [
      "I just finished reading...",
      "I really enjoyed watching...",
      "I would recommend it because..."
    ],
    "tips": [
      "Encourage sharing summaries or favorite scenes",
      "Good chance to explore language-learning methods too (like reading in English)",
      "People can bring books or movie screenshots to share visually"
    ]
  },
    {
    "week": "46",
    "title": "What do you like to do on a chilly autumn day?",
    "examples": [
      "What do you usually do on cold weekends?",
      "Do you enjoy taking walks in autumn?",
      "Do you like staying inside with a warm drink?",
      "Have you changed your daily routine as the weather changed?",
      "Do you do any crafts or hobbies at home in autumn?",
      "Do you like visiting hot springs or public baths?",
      "Have you switched to winter clothes yet?",
      "Do you enjoy cozy cafes or bookstores?",
      "What’s your ideal relaxing autumn day like?",
      "Is there anything you always do when it gets cold?"
    ],
    "phrases": [
      "I love staying in and...",
      "I usually go out to...",
      "It’s the perfect season for..."
    ],
    "tips": [
      "Encourage sharing of cozy routines or local places",
      "Great topic for discussing personal preferences and moods",
      "Can include foods, fashion, activities, or home routines"
    ]
  },
  {
    "week": "47",
    "title": "Do you like any fall traditions or events?",
    "examples": [
      "Have you ever participated in any fall festivals?",
      "Do you visit shrines for Shichi-Go-San?",
      "Do you like looking at autumn leaves?",
      "Have you been on any trips recently?",
      "Is there a place you always visit in autumn?",
      "Do you celebrate Labor Thanksgiving Day?",
      "What’s your favorite fall event in your area?",
      "Do you do anything special for November holidays?",
      "Have you taken any fall photos recently?",
      "Are there any events that remind you of your childhood?"
    ],
    "phrases": [
      "I always go to...",
      "I used to enjoy...",
      "My family usually..."
    ],
    "tips": [
      "Use this week to invite participants to share memories and local experiences",
      "Good opportunity to compare traditions across cultures",
      "Visual aids (like photos or websites) can enhance the conversation"
    ]
  },    
{
  "week": "48",
  "title": "Do you feel the year is ending soon?",
  "examples": [
    "How do you feel when December is coming?",
    "Do you start planning for the end of the year?",
    "What kind of things do you want to finish before the year ends?",
    "Do you get busier in this season?",
    "Have you achieved your goals for this year?",
    "Do you send end-of-year greetings or cards?",
    "Do you reflect on the year in any way?",
    "Do you have any end-of-year events at work or school?",
    "Do you like this time of year?",
    "Do you make a to-do list before the new year?"
  ],
  "phrases": [
    "It’s hard to believe the year is almost over.",
    "I need to wrap things up before the holidays.",
    "This season always feels hectic."
  ],
  "tips": [
    "A good time to reflect and share thoughts about the year so far.",
    "Participants can talk about habits, routines, or time management.",
    "Can lead to discussions on goal setting or work-life balance."
  ]
},
{
  "week": "49",
  "title": "Do you like winter?",
  "examples": [
    "How do you usually spend time in winter?",
    "Do you like the cold weather?",
    "What’s your favorite winter activity?",
    "Have you ever built a snowman or gone skiing?",
    "What’s your favorite winter food or drink?",
    "Do you like any winter holidays?",
    "Do you have any tips to stay warm?",
    "Do you feel more or less active in winter?",
    "What do you wear in winter?",
    "Do you prefer summer or winter? Why?"
  ],
  "phrases": [
    "I love the crisp air in winter.",
    "I’m not a fan of cold weather.",
    "Hot drinks are a must in winter."
  ],
  "tips": [
    "Can include both lifestyle and emotional responses to the season.",
    "Encourage sharing local customs or climate differences.",
    "Consider asking for photos or descriptions of typical winter days."
  ]
},
{
  "week": "50",
  "title": "What do you do for the holidays?",
  "examples": [
    "Do you have any plans for the holidays?",
    "What does your family usually do for New Year’s or Christmas?",
    "Do you like staying home or going somewhere?",
    "Are you preparing any gifts?",
    "What’s your favorite holiday memory?",
    "Do you celebrate with friends or family?",
    "What kind of food do you usually eat?",
    "Is your holiday season busy or relaxing?",
    "Do you decorate your house?",
    "Do you enjoy holiday music or movies?"
  ],
  "phrases": [
    "I usually spend the holidays…",
    "My family always…",
    "This year, I’m planning to…"
  ],
  "tips": [
    "Good time to compare cultural traditions (e.g., Christmas vs. New Year in different countries)",
    "Encourage discussion about holiday foods, events, or break plans",
    "Optional: Bring or show a holiday decoration/photo"
  ]
},
{
  "week": "51",
  "title": "How do you prepare for the new year?",
  "examples": [
    "Do you do a big cleaning at the end of the year?",
    "What’s your must-do before January?",
    "Do you make a to-do list or goals?",
    "How do you organize your home or schedule?",
    "Do you send any New Year cards?",
    "Do you go shopping for the new year?",
    "Do you feel excited or stressed about the new year?",
    "Do you have any customs or habits for this season?",
    "What do you want to finish before the year ends?",
    "How do you relax during this busy time?"
  ],
  "phrases": [
    "I always clean…",
    "Before the year ends, I try to…",
    "I feel ___ about the coming year."
  ],
  "tips": [
    "Encourage students to share cultural or family customs",
    "Talk about both physical and mental preparation",
    "Include productivity hacks or routines"
  ]
},
{
  "week": "52",
  "title": "Looking back on the year",
  "examples": [
    "What was the best thing that happened this year?",
    "Did you achieve any personal goals?",
    "What challenges did you face?",
    "What did you learn this year?",
    "How did your daily life change?",
    "What made you happy this year?",
    "Did you try anything new?",
    "What would you do differently next year?",
    "Who had the biggest impact on you?",
    "If you could describe this year in one word, what would it be?"
  ],
  "phrases": [
    "This year, I…",
    "One thing I learned was…",
    "Next year, I hope to…"
  ],
  "tips": [
    "Encourage reflection and storytelling",
    "Use this as a wrap-up session with a positive tone",
    "Good time to build community by sharing personal stories"
  ]
},
{
  "week": "53",
  "title": "How do you spend New Year’s Eve and New Year’s Day?",
  "examples": [
    "What do you usually do on December 31st?",
    "Do you stay up until midnight?",
    "How do you celebrate New Year’s Day?",
    "Do you visit a shrine or temple?",
    "What’s your favorite New Year food?",
    "Do you watch any special TV shows?",
    "Do you set any new year resolutions?",
    "What’s your family tradition?",
    "Do you prefer quiet or lively celebrations?",
    "Have your New Year habits changed over time?"
  ],
  "phrases": [
    "I usually spend New Year’s Eve…",
    "My New Year’s tradition is…",
    "I like to start the year with…"
  ],
  "tips": [
    "Great time to compare Japanese customs with other countries",
    "Use this to review cultural vocabulary (e.g., おせち, 初詣)",
    "Ask about past experiences or funny stories"
  ]
}
]